manual_testing/data/GetSystemDateAndTime.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
		<GetSystemDateAndTime xmlns="http://www.onvif.org/ver10/device/wsdl"/>
	</s:Body>
</s:Envelope>