1.soap

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:device="http://www.onvif.org/ver10/device/wsdl" xmlns:sch="http://www.onvif.org/ver10/schema">
  <soap:Header>
    <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://www.onvif.org/ver10/device/wsdl/GetDeviceInformation</wsa:Action>
  </soap:Header>
  <soap:Body>
     <device:GetDeviceInformation/>{consumer}
  </soap:Body>
</soap:Envelope>