examples/acc_unv_192_168_1_104/device/GetCapabilities.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
	xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:tt="http://www.onvif.org/ver10/schema"
	xmlns:tns1="http://www.onvif.org/ver10/topics"
	xmlns:wsa="http://www.w3.org/2005/08/addressing"
	xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:ter="http://www.onvif.org/ver10/error"
	xmlns:tavg="http://www.avigilon.com/onvif/ver10/avigilon-types"
	xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
	xmlns:xmime="http://www.w3.org/2005/05/xmlmime"
	xmlns:xop="http://www.w3.org/2004/08/xop/include"
	xmlns:msianasens="http://www.motorolasolutions.com/onvif/analytics/sensor"
	xmlns:msianavid="http://www.motorolasolutions.com/onvif/analytics/video"
	xmlns:msiptz="http://www.motorolasolutions.com/onvif/ptz">
	<SOAP-ENV:Header>
		<wsse:Security>
			<wsu:Timestamp wsu:Id="Time">
				<wsu:Created>2026-01-07T14:52:55Z</wsu:Created>
				<wsu:Expires>2026-01-07T14:54:55Z</wsu:Expires>
			</wsu:Timestamp>
			<wsse:UsernameToken wsu:Id="User">
				<wsse:Username>admin</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">0rMIuLUGVJ0+MNdi2EY7EyNSP2k=</wsse:Password>
				<wsse:Nonce>DnReaYeizRrtIW8L0GyNxSv+ejY=</wsse:Nonce>
				<wsu:Created>2026-01-07T14:52:55Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<tds:GetCapabilities>
			<tds:Category>All</tds:Category>
		</tds:GetCapabilities>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>